title: Rundll32.exe executing dll in Roaming
id: 057cbba0-731e-4798-9a0a-aadb3796f602
status: experimental
description: A rundll32.exe command-line argument contained TTPs of a recent Qakbot sample where a .dll file is loaded from the %APPDATA% directory
references:
    - <internet link>
author: Trent Liffick
date: 2023/12/18
tags:
    - attack.defense_evasion
    - attack.T1218.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_image:
        - Image|endswith: '\rundll32.exe'
    selection_path:
        CommandLine|contains:
            - '\AppData\Roaming\'
            - '.dll,'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium