title: Rundll32.exe executing dll in TEMP
id: 5bf90408-3c66-41f4-af60-c2a4e312f8eb
status: experimental
description: A rundll32.exe command-line argument contained TTPs of a recent Qakbot
      sample where a .dll file is loaded from the %TEMP% directory
references:
    - <internet link>
author: Trent Liffick
date: 2023/06/01
tags:
    - attack.defense_evasion
    - attack.T1218.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_image:
        - Image|endswith: '\rundll32.exe'
    selection_path:
        CommandLine|contains:
            - '\AppData\Local\Temp\'
            - '.dll,'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium