title: Suspicious network connection from mshta
id: f463515a-68cc-4c71-ba58-3d55853f21ed
status: experimental
description: mshta.exe established a network connection via internet protocols
references:
    - <internal link>
author: Trent Liffick
date: 2022/06/24
tags:
    - attack.defense_evasion
    - attack.T1218.005
logsource:
    product: windows
    category: process_creation
detection:
    selection_details:
        Image|endswith: '\mshta.exe'
        CommandLine|contains:
            - 'http://'
            - 'https://'
            - 'ftp://'
    condition: all of selection_*
falsepositives:
    - unknown
level: medium
